[
    {
        "ref": "1-1-1",
        "guideline": "1.1.1 - Non Text content",
        "guidance": "All non-text content like images, charts, icons and infographics, must have an appropriate text equivalent, or for decorative images and icons, an empty alt attribute.\n\nThis ensures that information conveyed by non-text content is available to people who cannot see it, like screen reader users, or where the image is decorative, isn't announced to screen reader users."
    },
    {
        "ref": "1-2-x",
        "guideline": "1.2.x - Alternatives for audio and video",
        "guidance": "Audio and video content has appropriate alternatives to ensure that everyone has a comparable experience when interacting with this content. This may include transcripts, captions and audio description depending on the type of audio or video content."
    },
    {
        "ref": "1-3-1a",
        "guideline": "1.3.1a - Info and relationships - Tables",
        "guidance": "When information is visually presented as a table, this structure must be conveyed appropriately to assistive technologies. This ensure that tables are available to screen reader, screen magnification and speech recognition tool users.\n\nWhere possible, you should use semantic HTML to implement content structures."
    },
    {
        "ref": "1-3-1b",
        "guideline": "1.3.1b - Info and relationships - Lists",
        "guidance": "When presenting lists of information, you must communicate this list in a way that assistive technology users can understand.\n\nWhere possible, you should use semantic HTML list options which are appropriate to the information being presented, for example: &lt;ul&gt; for unordered lists like lists of text, and &lt;ol&gt; for ordered, or numbered lists."
    },
    {
        "ref": "1-3-1c",
        "guideline": "1.3.1c - Info and relationships - Headings",
        "guidance": "Where visual headings are used to communicate the structure of a page, they must also be communicated in a way that supports assistive technology users to access this structure.\n\nYou should use semanatic HTML headings to structure your page. Heads should cascade from H1-H6. Each page must have at least a Level 1 Heading (H1)."
    },
    {
        "ref": "1-3-1d",
        "guideline": "1.3.1d - Info and relationships - Form fields",
        "guidance": "All form fields have an associated visible label. Where this isn’t possible a non-visible label must be present.\n\nSets of radio buttons or checkboxes must be grouped together so that assistive technology users can understand the relationship between these controls.\n\nWhere specific format or input requirements need to be met, hint text linked to the form fields is provided."
    },
    {
        "guideline": "1.3.1e - Info and relationship - Landmarks",
        "guidance": "Content sections within a page should have an appropriate HTML5 section element or ARIA landmark role defined."
    },
    {
        "ref": "1-3-2",
        "guideline": "1.3.2 - Meaningful sequence",
        "guidance": "When the order of content is important, the content order must be preserved no matter how it is presented to the user.\n\nThis ensures that the order of content is meaningful whether someone is looking at it, listening to it with a screen reader, or has stripped out visual styling using a browser plugin."
    },
    {
        "ref": "1-3-3",
        "guideline": "1.3.3 - Sensory Characteristics",
        "guidance": "Instructions must not depend on sensory characteristics like shape, size, colour, or location. This ensures that instructions can be understood by users who are unable to see or recognise information communicated using sensory characteristics."
    },
    {
        "ref": "1-3-4",
        "guideline": "1.3.4 - Orientation",
        "guidance": "A page view must not be locked to either horizontal or vertical views only, unless this is essential.\n\nThere are exceptions where ‘essential’ orientation locking applies."
    },
    {
        "ref": "1-3-5",
        "guideline": "1.3.5 - Identify Input Purpose",
        "guidance": "In an input  field, the purpose of each input field that collects information about the user can be understood by assistive technologies and browsers by using autocomplete."
    },
    {
        "ref": "1-4-1",
        "guideline": "1.4.1 - Use of colour",
        "guidance": "Information conveyed with colour must also be identifiable from context, labelling, or alternative forms."
    },
    {
        "ref": "1-4-2",
        "guideline": "1.4.2 - Audio control",
        "guidance": "Audio/video must not play automatically unless the user is pre-warned and can control the audio."
    },
    {
        "ref": "1-4-3",
        "guideline": "1.4.3 - Contrast",
        "guidance": "There should be enough difference (contrast) between a background and the foreground content so that user can easily differentiate the two."
    },
    {
        "ref": "1-4-4",
        "guideline": "1.4.4 - Resize text",
        "guidance": "Users should be able to resize text up to 200% without any problems with the presentation and structure of the page (for example truncated text, overlaps or missing items)."
    },
    {
        "ref": "1-4-5",
        "guideline": "1.4.5 - Images of text",
        "guidance": "Meaningful text must not be presented as part of an image because it cannot be resized,  it deteriorates in quality when magnified and is not customisable by the end user.\n\nMeaningful text is anything which is used to aid understanding for users."
    },
    {
        "ref": "1-4-10",
        "guideline": "1.4.10 - Reflow",
        "guidance": "Users should be able to magnify the page up to 400% and content should reflow - move into one column - and not add horizontal scroll bars.\n\nContent should not be cut off or omitted entirely when magnified."
    },
    {
        "ref": "1-4-11",
        "guideline": "1.4.11 - Non text contrast",
        "guidance": "Interactive controls, keyboard focus, icons and content required for understanding e.g. charts and infographics must have enough contrast (at least 3:1) with adjacent colours."
    },
    {
        "ref": "1-4-12",
        "guideline": "1.4.12 - Text spacing",
        "guidance": "For regular HTML page content, no loss of content or functionality happens when a user changes line height, letter or word spacing."
    },
    {
        "ref": "1-4-13",
        "guideline": "1.4.13 - Content on hover or focus",
        "guidance": "Ensuring that extra content eg tooltips: can be viewed easily, don’t cover up key content, can be dismissed without moving focus or hover, can be hovered over (i.e. it doesn’t disappear if you move the mouse), is persistent and doesn’t disappear until the user moves focus/hover away"
    }
]